#!/usr/bin/env sh


echo "Shell 传递参数实例！"
echo "执行文件名: $0"
echo "第一个参数为:$1"
echo "第二个参数为:$2"
echo "第三个参数为:$3"
echo "@全部参数为:$@" #与$*相同，但是使用时加引号，并在引号中返回每个参数: "$1" "$2" … "$n" 的形式输出所有参数。
echo "*全部参数为:$*" #以一个单字符串显示所有向脚本传递的参数： "$1 $2 $3 ... $n"
echo "传递脚本的参数个数:$#"
echo "后台运行的最后一个进程的ID号:$!"
echo "脚本运行的当前进程的ID号:$$"
echo "显示最后命令的退出状态：$? ,其中：0表示没有错误，其他任何值表示有错误。"
echo "================================================================================================="

echo "------------------------------------------- \$* 演示 ---------------------------------------------"
for i in "$*"; do
	echo $i
done

echo "------------------------------------------- \$@ 演示 ---------------------------------------------"
for i in "$@"; do
	echo $i
done
echo "================================================================================================="

#数组
my_array=(a b "c" d 1 2 3)
echo "数组的元素为:${my_array[@]}"
echo "数组的元素为:${my_array[*]}"
echo "数组长度为:${#my_array[*]}"
echo "数组长度为:${#my_array[@]}"

for i in ${my_array[@]}; do
	echo $i
done
echo "================================================================================================="




